{
    "general": [
      "What’s a lie you’ve told that you still feel guilty about?",
      "What’s something you hope your parents never find out?",
      "Have you ever stalked someone online? What did you find?",
      "What’s the most embarrassing thing you’ve ever done in public?",
      "What’s something you’ve done that you’d never post on social media?",
      "What’s your most irrational fear — that still gets you?",
      "Have you ever cried in a situation where you had to pretend everything was fine?",
      "What’s the most awkward thing you’ve said to someone you liked?",
      "What’s a personality trait you secretly wish you didn’t have?",
      "What’s something you judge other people for — but pretend you don’t?",
      "Have you ever tried to impress someone and completely failed?",
      "What’s a childish habit or belief you still secretly hold on to?",
      "If your phone were unlocked and handed around, what app would you panic about?",
      "Have you ever told someone you liked something (movie, food, music) just to fit in?",
      "What’s a compliment you received that felt fake — but you pretended to like anyway?",
      "Have you ever ruined something and let someone else take the blame?",
      "What’s one mistake you keep repeating — even though you know better?",
      "What’s something you’ve never told your best friend — and probably never will?",
      "What’s a goal you pretend to care about, but really don’t?",
      "What’s the biggest assumption people make about you that’s totally wrong?"
    ],
    "friends": [
      "Have you ever lied to a friend to avoid hanging out — and what was the excuse?",
      "What’s something you admire in a friend but would never admit out loud?",
      "Have you ever been secretly happy about a friend’s failure?",
      "Have you ever talked behind a friend’s back? What did you say?",
      "If you had to kick one person out of your friend group, who would it be?",
      "What’s something you envy about someone here — but pretend you don’t care?",
      "Have you ever made fun of a friend when they weren’t around?",
      "What’s something a friend does that secretly annoys you?",
      "Have you ever stolen a friend’s idea or taken credit for something they did?",
      "Have you ever had a crush on a friend’s partner or ex?",
      "What’s a petty reason you’ve judged a friend — even just in your head?",
      "Who in this group do you trust the least, and why?",
      "Have you ever pretended to support a friend but secretly disagreed?",
      "Have you ever competed with a friend without them knowing?",
      "What’s something a friend said that hurt you — but you never told them?",
      "Have you ever faked enthusiasm for a friend’s news or success?",
      "Who in this room would you never want to be stuck with on a road trip?",
      "Have you ever gossiped about someone in this group?",
      "What’s something you've done to a friend that you still feel bad about?",
      "Have you ever tried to make someone jealous — and used a friend to do it?"
    ],
    "couple": [
      "What’s something you’ve never told your partner because you’re afraid of how they’d react?",
      "Have you ever compared your current partner to someone from your past — mentally or physically?",
      "What’s one thing your partner does in bed that you’re not into, but haven’t said anything about?",
      "If your partner couldn’t satisfy you sexually — would you tell them?",
      "What’s one insecurity you have in this relationship that you try to hide?",
      "Have you ever had a romantic or sexual dream about someone else while with your partner?",
      "What’s something your partner doesn’t know about your sexual history?",
      "Have you ever fantasised about a different life without your current partner?",
      "What’s something your partner does that annoys you — but you stay quiet about?",
      "Have you ever felt emotionally closer to someone other than your partner?",
      "If your partner cheated and promised never to do it again, would you stay?",
      "What’s the biggest secret you’ve kept from your partner during the relationship?",
      "Have you ever pretended to be in a good mood just to avoid a fight?",
      "What’s something you’ve lied about to keep your partner happy?",
      "If you could change one thing about your partner without them knowing — what would it be?",
      "Do you feel fully accepted by your partner — or are you holding parts of yourself back?",
      "Have you ever been tempted to go through your partner’s phone? Did you?",
      "What’s one fantasy you’ve had but are scared to tell your partner?",
      "If you and your partner broke up tomorrow, what would you miss the most — and the least?",
      "What’s something from your past that could make your partner see you differently?"
    ],
    "party": [
      "Read the last message you sent — with full dramatic flair.",
      "Do your best impersonation of someone else in this room — until someone guesses who.",
      "Show the last selfie you took — no explanations.",
      "Let someone in the room scroll through your camera roll for 10 seconds.",
      "Sing the chorus of the last song you listened to — or drink.",
      "Tell the group who you’d hook up with — if you had to pick someone here.",
      "Text 'You up?' to someone random in your contacts and show us their reply later.",
      "Swap an item of clothing with someone of the opposite gender.",
      "Let someone give you a new profile picture — and set it for 5 minutes.",
      "Let the group write one sentence to post in your group chat — or back out and drink.",
      "Do a sexy dance to a random song — someone else picks the track.",
      "Give a lap dance to someone chosen by the group — or finish your drink.",
      "Attempt to twerk for 10 seconds — no excuses.",
      "Take a selfie with the person to your left and post it somewhere with zero context.",
      "Let someone else go through your most-used emojis and guess your last 3 convos.",
      "Call someone and confess a fake crush — make it believable.",
      "Let someone draw something on your face using eyeliner, marker, or pen.",
      "Let someone go through your Spotify or YouTube history and read out something embarrassing.",
      "Do your best 'moan' — loud enough for a neighbour to hear.",
      "Let the person to your right write a one-line bio for your dating profile."
    ],
    "nsfw": [
      "Have you ever made out, fooled around, or more — while on the job?",
      "What’s the most degrading thing you've let someone do to you — and secretly enjoyed?",
      "Have you ever sent nudes while someone else was in the room — without them knowing?",
      "What’s your weirdest or most taboo porn search — be honest.",
      "Have you ever hooked up with someone whose name you never learned — and still don’t know?",
      "Describe your dirtiest hookup like you’re turning someone on.",
      "What’s a kink you’ve tried and loved — but wouldn’t tell your friends about?",
      "Have you ever been caught doing something explicit? What happened next?",
      "Have you ever lied about protection during sex?",
      "Tell the group who you’d hook up with — if you had to pick someone here.",
      "Have you ever cheated emotionally or physically and not told anyone?",
      "What’s something you’ve done sexually that still surprises *you*?",
      "Who’s someone you fantasised about — even though it felt morally wrong?",
      "Have you ever roleplayed something you’d never admit in public?",
      "Have you ever used someone purely for sex?",
      "Have you ever left one person’s bed and gone straight to someone else’s?",
      "What’s the kinkiest request you've received — and did you go through with it?",
      "Have you ever tried something and thought, 'This is too much — even for me'?",
      "Have you ever risked getting caught just for the thrill of it — where?",
      "What’s something explicit you’ve filmed or photographed — and who still has it?",
      "Have you ever been part of a threesome, group, or more?",
      "What’s the most inappropriate place you’ve started something?",
      "What’s the most manipulative thing you’ve done to get someone into bed?",
      "What’s the one sexual secret you hope no one in this room ever finds out?",
      "What’s something that turns you on, but you’d die if someone found out?",
      "What’s something you’ve only said during sex — but actually meant?"
    ]
  }